tap "espanso/espanso"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "nikitabobko/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU compiler collection
brew "gcc"
# Source code tag system
brew "global"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DNS library written in C
brew "ldns"
# Text-based web browser
brew "lynx"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Golang
brew "go"
# Rust Toolchain
brew "rust"
# Node Version Manager
brew "nvm"
# FD / FZF
brew "fzf"
brew "fd"
# App to build and share containerized applications and microservices
cask "docker"
# Cross-platform Text Expander written in Rust
cask "espanso"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
# cask "ngrok"
# 1-Password
cask "1password"
cask "1password-cli"
# Ghostty terminal
cask "ghostty@tip"
# Brave Browser
cask "brave-browser"
# Chrome Browser
cask "google-chrome"
# Karabiner Elements - for keyboard tuning.
cask "karabiner-elements"
# Postman API tool
cask "postman"
# Rectangle window management tool.
cask "rectangle"
# Shortcat for instant keybord shortcuts.
cask "shortcat"
# Slack
cask "slack"
# Tunnelblick VPN tool.
cask "tunnelblick"
# Amethyst for auto window layouts.
cask "amethyst"
# Aerospace Tiling Manager
cask "aerospace"
# Cursor AI code editor.
cask "cursor"
# Visual Studio Code
cask "visual-studio-code"
# HammerSpoon - A Mac automation/power tool
cask "hammerspoon"
# Hiddenbar - Managing Mac menu bar
cask "hiddenbar"
# AlDente - remove this if you have Pro
cask "aldente"
