tap "espanso/espanso"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "surrealdb/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line tools for fly.io services
brew "flyctl"
# Free Pascal: multi-architecture Pascal compiler
brew "fpc"
# GNU compiler collection
brew "gcc"
# Source code tag system
brew "global"
# GNU implementation of time utility
brew "gnu-time"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DNS library written in C
brew "ldns"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Text-based web browser
brew "lynx"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Optimized BLAS library
brew "openblas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Build applications with serverless architectures
brew "serverless"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# A scalable, distributed, collaborative, document-graph database
brew "surrealdb/tap/surreal"
# Free and open-source web browser
cask "chromium"
# App to build and share containerized applications and microservices
cask "docker"
# Cross-platform Text Expander written in Rust
cask "espanso"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Local development environment and DevOps tool built on Docker
cask "lando"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# MySQL/MariaDB database management
cask "sequel-ace"
